---
kind: other
id: Properties.T:Autodesk.Revit.DB.PerformanceAdviserRuleId
source: html/522ff891-c9ea-10ba-2520-ddc6c82d3f5d.htm
---
# PerformanceAdviserRuleId Properties

The Guid of GUID-based enum object.